# 目标点坐标 2k 缩放76
# target_x = 1113
# target_y = 1315

# 带鱼
target_x = 1113
target_y = 1315

# 颜色字典, 分别对应 未选牌时的颜色, 蓝色, 红色, 黄色
# 2k
# color_dict = {
#     "default": (90, 36, 156),
#     "blue": (66, 60, 181),
#     "red": (239, 31, 32),
#     "yellow": (231, 227, 0)
# }

# 带鱼
color_dict = {
    "default": (90, 36, 156),
    "blue": (66, 60, 181),
    "red": (239, 31, 32),
    "yellow": (231, 227, 0)
}

# color_dict = {
#     "default": (90, 36, 156),
#     "blue": (66, 60, 181),
#     "red": (239, 31, 32),
#     "yellow": (231, 227, 0)
# }